app/views/users/show.html.erb

SELECT "pins".* FROM "pins" WHERE "pins"."user_id" = ?  [["user_id", 2]]
---
<% @user.pins.each do |pin| %>