app/controllers/pins_controller.rb

  def create
    @pin = current_user.pins.build(pin_params)

    respond_to do |format|
      if @pin.save
---
INSERT INTO "pins" ("description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "background"], ["user_id", 1], ["created_at", "2016-05-24 02:24:52.342878"], ["updated_at", "2016-05-24 02:24:52.342878"]]

  def update
    respond_to do |format|
      if @pin.update(pin_params)
---
UPDATE "pins" SET "description" = ?, "updated_at" = ? WHERE "pins"."id" = ?  [["description", "first pin_edit"], ["updated_at", "2016-05-22 23:17:09.782030"], ["id", 1]]

  def destroy
    @pin.destroy
---
DELETE FROM "pins" WHERE "pins"."id" = ?  [["id", 10]]

    def set_pin
      @pin = Pin.find(params[:id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT 1  [["id", 10]]